In [1]:
import numpy  as np
import pandas as pd

In [2]:
df = pd.read_csv('numpanda.csv')

In [3]:
df.head()

,Scorecard,Team 1,Team 2,Winner,Margin,Ground,Match Date
0,ODI # 1,Australia,England,Australia,5 wickets,Melbourne,"Jan 5, 1971"
1,ODI # 2,England,Australia,England,6 wickets,Manchester,"Aug 24, 1972"
2,ODI # 3,England,Australia,Australia,5 wickets,Lord's,"Aug 26, 1972"
3,ODI # 4,England,Australia,England,2 wickets,Birmingham,"Aug 28, 1972"
4,ODI # 5,New Zealand,Pakistan,New Zealand,22 runs,Christchurch,"Feb 11, 1973"

In [6]:
df.describe()

,Scorecard,Team 1,Team 2,Winner,Margin,Ground,Match Date
count,3932,3932,3932,3932,3753,3932,3932
unique,3932,24,25,25,227,173,3386
top,ODI # 1,Australia,Sri Lanka,Australia,6 wickets,Sharjah,"Feb 4, 2007"
freq,1,583,508,555,347,228,6

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3932 entries, 0 to 3931
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Scorecard   3932 non-null   object
 1   Team 1      3932 non-null   object
 2   Team 2      3932 non-null   object
 3   Winner      3932 non-null   object
 4   Margin      3753 non-null   object
 5   Ground      3932 non-null   object
 6   Match Date  3932 non-null   object
dtypes: object(7)
memory usage: 215.2+ KB

In [8]:
a = np.array([1, 10, 2, 0])
np.power(a, 2)

array([  1, 100,   4,   0], dtype=int32)

In [11]:
a = np.array([['m', 'l'],['n', 'o']])
a[0,1]

'l'

In [15]:
array = np.arange(10) 
np.hsplit(array,2)

[array([0, 1, 2, 3, 4]), array([5, 6, 7, 8, 9])]

In [17]:
array1 = np.array([1, 0, 0, 1, 0])
array2 = np.arange(5)
array1 + array2

array([1, 1, 2, 4, 4])

In [19]:
df.isnull().sum()

Scorecard       0
Team 1          0
Team 2          0
Winner          0
Margin        179
Ground          0
Match Date      0
dtype: int64

In [39]:
# Which team had won the 50th ODI match?
df.iloc[[49]]["Winner"]

49    England
Name: Winner, dtype: object

In [69]:
# df["Ground"].value_counts()["Manchester"]
df[df['Ground']=='Devonport']

     Scorecard   Team 1       Team 2   Winner   Margin     Ground   Match Date
429  ODI # 430  England  West Indies  England  29 runs  Devonport  Feb 3, 1987

In [74]:
# How many times has the team Australia has won the ODI matches?
df[df["Winner"] == "Australia"]

,Scorecard,Team 1,Team 2,Winner,Margin,Ground,Match Date
0,ODI # 1,Australia,England,Australia,5 wickets,Melbourne,"Jan 5, 1971"
2,ODI # 3,England,Australia,Australia,5 wickets,Lord's,"Aug 26, 1972"
9,ODI # 10,New Zealand,Australia,Australia,7 wickets,Dunedin,"Mar 30, 1974"
10,ODI # 11,New Zealand,Australia,Australia,31 runs,Christchurch,"Mar 31, 1974"
20,ODI # 21,Australia,Pakistan,Australia,73 runs,Leeds,"Jun 7, 1975"
...,...,...,...,...,...,...,...
3816,ODI # 3817,Australia,Pakistan,Australia,92 runs,Brisbane,"Jan 13, 2017"
3819,ODI # 3820,Australia,Pakistan,Australia,7 wickets,Perth,"Jan 19, 2017"
3821,ODI # 3822,Australia,Pakistan,Australia,86 runs,Sydney,"Jan 22, 2017"
3825,ODI # 3826,Australia,Pakistan,Australia,57 runs,Adelaide,"Jan 26, 2017"
3916,ODI # 3917,India,Australia,Australia,21 runs,Bengaluru,"Sep 28, 2017"

In [75]:
#How many times the second team, i.e., 'Team 2' has won the ODI match?
(df['Team 2']==df['Winner']).sum()

1637